Series and DataFrames

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
x = Series([30,40,50]) #indexed the values
x

0    30
1    40
2    50
dtype: int64

In [3]:
x.values

array([30, 40, 50])

In [4]:
x.index

RangeIndex(start=0, stop=3, step=1)

Creating series

In [5]:
#CUSTOM index 
Sales = Series([450000, 650000, 870000], index = ["Don", "Mike", "Edwin"])
Sales

Don      450000
Mike     650000
Edwin    870000
dtype: int64

In [6]:
type(Sales)

pandas.core.series.Series

Sales["Don"] #use index to retireve specific value

In [9]:
Sales[Sales>500000] #checking for conditions

Mike     650000
Edwin    870000
dtype: int64

In [10]:
"Don" in Sales #checking for existence of value bool

True

In [11]:
"John" in Sales

False

Converting series to dictionaries

In [15]:
#to_dict() to convert series to dictionaries
Sales_dict = Sales.to_dict()
Sales_dict

{'Don': 450000, 'Mike': 650000, 'Edwin': 870000}

In [16]:
Sales_series = Series(Sales_dict)
Sales_series

Don      450000
Mike     650000
Edwin    870000
dtype: int64

In [17]:
Sales_dict

{'Don': 450000, 'Mike': 650000, 'Edwin': 870000}

In [19]:
new_index = ["Don","Mike","Edwin","John"]

#new series made from the updated series
newsales = Series(Sales_dict,index = new_index)
newsales

Don      450000.0
Mike     650000.0
Edwin    870000.0
John          NaN
dtype: float64

In [20]:
pd.isnull(newsales) #finding NULL values

Don      False
Mike     False
Edwin    False
John      True
dtype: bool

In [21]:
Sales + newsales #adding values from two series

Don       900000.0
Edwin    1740000.0
John           NaN
Mike     1300000.0
dtype: float64

In [22]:
newsales.name = "Total Sales" #naming a series
newsales

Don      450000.0
Mike     650000.0
Edwin    870000.0
John          NaN
Name: Total Sales, dtype: float64

In [23]:
newsales.index.name = "Sales Person"
newsales

Sales Person
Don      450000.0
Mike     650000.0
Edwin    870000.0
John          NaN
Name: Total Sales, dtype: float64

CREATING A DATAFRAME (WORKSHEET)

DataFrames are similar to excel ws
Both have rows and cols of data

In [24]:
data = [["Adrian", 20], ["Beatrice", 32], ["Chloe", 41]]
df = pd.DataFrame(data, columns = ["Name", "Age"], dtype = int)
df

       Name  Age
0    Adrian   20
1  Beatrice   32
2     Chloe   41

In [25]:
# This typecasts the FLOAT variables into integers
df["Age"] = df["Age"].values.astype(int)
df["Age"]

0    20
1    32
2    41
Name: Age, dtype: int64

USING DEFAULT INDEX

In [26]:
new = {"New": ["Tom", "Jack", "Steve", "Ricky"], "Sales": [25000, 30000, 35000, 40000]}
df2 = pd.DataFrame(new)
df2

     New  Sales
0    Tom  25000
1   Jack  30000
2  Steve  35000
3  Ricky  40000

CUSTOMISE INDEX VALUES

In [27]:
df2 = pd.DataFrame(new, index = ["rank1", "rank2", "rank3", "rank4"])
df2

         New  Sales
rank1    Tom  25000
rank2   Jack  30000
rank3  Steve  35000
rank4  Ricky  40000

WITHOUT PASSING VALUE INDEX

In [28]:
data = [{"a": 1, "b": 2}, {"a": 5, "b": 10, "c": 15}]
df3 = pd.DataFrame(data)
df3

   a   b     c
0  1   2   NaN
1  5  10  15.0

BY APPLYING INDEX VALUES

In [29]:
data1 = [{"East": 15000, "West": 20000}, {"East": 5000, "West": 10500, "South": 20000}]
df4 = pd.DataFrame(data1, index = ["Sales1", "Sales2"], columns = ["East", "West"])
df4

         East   West
Sales1  15000  20000
Sales2   5000  10500

In [31]:
df4 = pd.DataFrame(data1, index = ["Sales1", "Sales2"], columns = ["East", "West", "South"])
df4

         East   West    South
Sales1  15000  20000      NaN
Sales2   5000  10500  20000.0

FROM DICTIONARIES OF SERIES

In [33]:
Sales = {"East": pd.Series([1000, 2000, 3000], index = ["Q1", "Q2", "Q3"]), 
        "West": pd.Series([15000, 25000, 35000, 45000], index = ["Q1", "Q2", "Q3", "Q4"])}

In [35]:
Sales_df5 = pd.DataFrame(Sales)
Sales_df5

      East   West
Q1  1000.0  15000
Q2  2000.0  25000
Q3  3000.0  35000
Q4     NaN  45000

Adding cols to DataFrame

In [36]:
Sales_df5["South"] = pd.Series([17000, 27000, 37000], index = ["Q1", "Q2", "Q3"])
Sales_df5

      East   West    South
Q1  1000.0  15000  17000.0
Q2  2000.0  25000  27000.0
Q3  3000.0  35000  37000.0
Q4     NaN  45000      NaN

Adding values in the DataFrame

In [37]:
Sales_df5["North"] = Sales_df5["East"] + Sales_df5["West"]
Sales_df5

      East   West    South    North
Q1  1000.0  15000  17000.0  16000.0
Q2  2000.0  25000  27000.0  27000.0
Q3  3000.0  35000  37000.0  38000.0
Q4     NaN  45000      NaN      NaN

Indexing and Reindexing OBJECTS

In [38]:
Sales = Series([450000, 650000, 870000], index = ["Don", "Mike", "Edwin"])
Sales

Don      450000
Mike     650000
Edwin    870000
dtype: int64

In [39]:
SalesReindexed = Sales.reindex(["Don", "Luke", "Edwin"])
SalesReindexed

Don      450000.0
Luke          NaN
Edwin    870000.0
dtype: float64

In [41]:
SalesReindexed = Sales.reindex(["Don", "Luke", "Edwin"], fill_value = 0)
SalesReindexed #replace NULL values with 0

Don      450000
Luke          0
Edwin    870000
dtype: int64

Indexing and Reindexing DATAFRAMES

In [42]:
data = {"County": ["Croydon", "Cornwall", "Hampshire"],
       "Year": [2011, 2013, 2014],
       "Sales": [20000, 35000, 45000]}

Sales_df6 = pd.DataFrame(data)
Sales_df6

      County  Year  Sales
0    Croydon  2011  20000
1   Cornwall  2013  35000
2  Hampshire  2014  45000

In [43]:
# This changes the order of the data
Sales_df6.reindex([2, 1, 0])

      County  Year  Sales
2  Hampshire  2014  45000
1   Cornwall  2013  35000
0    Croydon  2011  20000

In [44]:
# You cannot reindex RANDOM values!
Sales_df6.reindex([20, 30, 40])

   County  Year  Sales
20    NaN   NaN    NaN
30    NaN   NaN    NaN
40    NaN   NaN    NaN

In [45]:
# This changes the order of the columns
columnsTitles = ["Year", "Sales", "County"]
Sales_df6.reindex(columns = columnsTitles)

   Year  Sales     County
0  2011  20000    Croydon
1  2013  35000   Cornwall
2  2014  45000  Hampshire

Dropping index

In [46]:
ser1 = Series(np.arange(3),index = ("aa","bb","cc"))
ser1

aa    0
bb    1
cc    2
dtype: int64

In [47]:
ser1.drop("cc")

aa    0
bb    1
dtype: int64

In [48]:
# the reshape function here shapes the data in a 3 by 3 formation
Sales_df7 = DataFrame(np.arange(9).reshape(3, 3), index = ["SF", "NYC", "BO"],
                     columns = ["Country", "Region", "Sales"])
Sales_df7

     Country  Region  Sales
SF         0       1      2
NYC        3       4      5
BO         6       7      8

In [49]:
Sales_df7.drop("SF")

     Country  Region  Sales
NYC        3       4      5
BO         6       7      8

Selecting entries

In [50]:
ser2 = Series(np.arange(3), index = ["AA", "BB", "CC"])
ser2

AA    0
BB    1
CC    2
dtype: int64

In [52]:
ser3 = ser2 * 2
ser3

AA    0
BB    2
CC    4
dtype: int64

In [53]:
ser3["BB"] #return value for BB

2

In [54]:
ser3[2] #use index to return value of index 2

4

In [56]:
ser3[0:2]
ser3[["AA","BB"]]

AA    0
BB    2
dtype: int64

In [57]:
ser3[ser3 > 2] #retrieve data using condition

CC    4
dtype: int64

In [58]:
ser3[ser3 > 2] = 20 #replaces value that satisfies condition
ser3

AA     0
BB     2
CC    20
dtype: int64

In [59]:
data = {"County": ["Croydon", "Cornwall", "Cumbria", "Durham", "Hampshire"],
       "Year": [2012, 2012, 2013, 2014, 2014],
       "Sales": [45000, 24000, 31000, 20000, 30000]}

Sales_df8 = pd.DataFrame(data)
Sales_df8

      County  Year  Sales
0    Croydon  2012  45000
1   Cornwall  2012  24000
2    Cumbria  2013  31000
3     Durham  2014  20000
4  Hampshire  2014  30000

In [60]:
Sales_df8.iloc[2,2] #extracting from specific location

31000

In [61]:
Sales_df8["Year"] #extracting specific col

0    2012
1    2012
2    2013
3    2014
4    2014
Name: Year, dtype: int64

In [63]:
Sales_df8[["Year","Sales"]] #extracting multiple cols

   Year  Sales
0  2012  45000
1  2012  24000
2  2013  31000
3  2014  20000
4  2014  30000

In [65]:
Sales_df8[Sales_df8["Sales"] > 24000] #checking values in df using a condition

      County  Year  Sales
0    Croydon  2012  45000
2    Cumbria  2013  31000
4  Hampshire  2014  30000

In [66]:
Sales_df8["Sales"] > 25000 #applying bool

0     True
1    False
2     True
3    False
4     True
Name: Sales, dtype: bool

In [68]:
Sales_df8.loc[2]

County    Cumbria
Year         2013
Sales       31000
Name: 2, dtype: object

Data alignment

In [70]:
Sales = Series([15000, 25000, 34000], index = ["East", "West", "South"])
Sales1 = Series([20000, 30000, 45000, 34000], index = ["East", "West", "South", "North"])

Sales + Sales1

East     35000.0
North        NaN
South    79000.0
West     55000.0
dtype: float64

In [71]:
Sales.add(Sales1, fill_value = 0) #NULL values become 0

East     35000.0
North    34000.0
South    79000.0
West     55000.0
dtype: float64

In [72]:
data = {"County": ["Croydon", "Cornwall", "Cumbria", "Durham", "Hampshire"],
       "Year": [2012, 2012, 2013, 2014, 2014],
       "Sales": [45000, 24000, 31000, 20000, 30000]}
Sales_df9 = pd.DataFrame(data)
Sales_df9

      County  Year  Sales
0    Croydon  2012  45000
1   Cornwall  2012  24000
2    Cumbria  2013  31000
3     Durham  2014  20000
4  Hampshire  2014  30000

In [73]:
data = {"County": ["Croydon", "Cornwall", "Cumbria"],
       "Year": [2012, 2012, 2013],
       "Sales": [45000, 24000, 31000]}
Sales_df10 = pd.DataFrame(data)
Sales_df10

     County  Year  Sales
0   Croydon  2012  45000
1  Cornwall  2012  24000
2   Cumbria  2013  31000

In [74]:
Sales_df9["Sales"] + Sales_df10["Sales"]

0    90000.0
1    48000.0
2    62000.0
3        NaN
4        NaN
Name: Sales, dtype: float64

In [78]:
Sales_df9["Sales"].add(Sales_df10["Sales"], fill_value = 0)

0    90000.0
1    48000.0
2    62000.0
3    20000.0
4    30000.0
Name: Sales, dtype: float64

Sorting and ranking

In [79]:
Sales = Series((35000, 40000, 45000, 50000), index = ["East", "West", "North", "South"])

In [80]:
Sales.sort_index(ascending = 1) # =1 is ASC

East     35000
North    45000
South    50000
West     40000
dtype: int64

In [81]:
Sales.rank(method = "dense", ascending = 0) #=0 is DESC

East     4.0
West     3.0
North    2.0
South    1.0
dtype: float64

In [82]:
Sales.rank(ascending = 1)

East     1.0
West     2.0
North    3.0
South    4.0
dtype: float64

In [83]:
data = {"County": ["Croydon", "Cornwall", "Cumbria", "Durham", "Hampshire"],
       "Year": [2012, 2012, 2013, 2014, 2014],
       "Sales": [45000, 24000, 31000, 20000, 30000]}
Sales_df11 = pd.DataFrame(data)
Sales_df11

      County  Year  Sales
0    Croydon  2012  45000
1   Cornwall  2012  24000
2    Cumbria  2013  31000
3     Durham  2014  20000
4  Hampshire  2014  30000

In [84]:
Sales_df11.sort_index(ascending = 1)

      County  Year  Sales
0    Croydon  2012  45000
1   Cornwall  2012  24000
2    Cumbria  2013  31000
3     Durham  2014  20000
4  Hampshire  2014  30000

In [85]:
#sorting by specific col
Sales_df11.sort_values(by = ["Sales"], ascending = 1)

      County  Year  Sales
3     Durham  2014  20000
1   Cornwall  2012  24000
4  Hampshire  2014  30000
2    Cumbria  2013  31000
0    Croydon  2012  45000

In [86]:
#creates another col in the exisitng dataframe
Sales_df11["Sales Ranked"] = Sales_df11["Sales"].rank(ascending = 1)
Sales_df11["Sales Ranked"] = Sales_df11["Sales Ranked"].values.astype(int)

Sales_df11

      County  Year  Sales  Sales Ranked
0    Croydon  2012  45000             5
1   Cornwall  2012  24000             2
2    Cumbria  2013  31000             4
3     Durham  2014  20000             1
4  Hampshire  2014  30000             3

In [87]:
#snapshot of the dataset
Sales_df11.describe()

         Year         Sales  Sales Ranked
count     5.0      5.000000      5.000000
mean   2013.0  30000.000000      3.000000
std       1.0   9513.148795      1.581139
min    2012.0  20000.000000      1.000000
25%    2012.0  24000.000000      2.000000
50%    2013.0  30000.000000      3.000000
75%    2014.0  31000.000000      4.000000
max    2014.0  45000.000000      5.000000

In [88]:
#finding unique values in the series
Sales = Series([25000, 20000, 25000, 25000, 45000])
Sales

0    25000
1    20000
2    25000
3    25000
4    45000
dtype: int64

In [89]:
Sales.unique()

array([25000, 20000, 45000])

In [91]:
#finding the occurences of a particular value
Sales.value_counts()[25000]

3